{
    "sobre-header": "Sobre mim",
    "projetos-header": "Projetos",
    "contato-header": "Contato",
    "tema-claro": "Tema claro",

    "ola": "Olá mundo,",
    "eu-sou": "Eu sou o <span>Romulo</span>,<br>Engenheiro de Software.",
    "descricao": "Focado em solucionar problemas com codigo limpo, boas praticas e atenção ao usuario. Sinta-se livre para explorar meus projetos e entrar em contato a qualquer momento.",

    "sobre-main": "Sobre mim",
    "paragrafo1": "Sou Engenheiro de Software com foco em desenvolvimento de soluções eficientes e escaláveis. Tenho experiência com <span>JAVASCRIPT, HTML, CSS, JAVA E PYTHON</span>, sempre priorizando código limpo e boas práticas.",
    "paragrafo2": "Tive a oportunidade de morar nos Estados Unidos por 1 ano durante um intercâmbio, onde pude aperfeiçoar o inglês e conquistar a fluência no idioma — experiência que também me ajudou a desenvolver habilidades de adaptação, comunicação e trabalho em ambientes multiculturais.",
    "paragrafo3": "Atualmente, busco oportunidades para colaborar com times que valorizem inovação, aprendizado constante e entrega de valor real através da tecnologia.",

    "idioma": "Idioma",
    "idioma-en": "Inglês: Fluente",
    "idioma-pt": "Português: Fluente",
    "idioma-es": "Espanhol: Intermediário",

    "habilidades": "Habilidades",
    "hab1": "Adaptabilidade",
    "hab2": "Comunicação",
    "hab3": "Proatividade",
    "hab4": "Trabalho em equipe",
    "hab5": "Organização",

    "tecnologias": "Outras Tecnologias",
    "tec1": "Git",
    "tec2": "Github",
    "tec3": "Figma",
    "tec4": "MySQL",
    "tec5": "PostgreSQL",

    "descricao-projeto1": "Este projeto é uma Landing Page para o grupo Onixx, desenvolvido como parte de um trabalho colaborativo. Ele demonstra habilidades em desenvolvimento front-end, incluindo a criação de interfaces modernas e responsivas, com foco em design e experiência do usuário (UX). O projeto reflete a capacidade de trabalhar em equipe, aplicar boas práticas de desenvolvimento web e utilizar ferramentas apropriadas para criar uma presença digital profissional.",

    "descricao-projeto2": "Este projeto é um sistema backend para gerenciamento de operações bancárias, desenvolvido em Java com o uso de frameworks e bibliotecas como JPA (Hibernate) para persistência de dados e MySQL como banco de dados relacional. Ele simula funcionalidades essenciais de um sistema bancário, incluindo: Gerenciamento de Clientes e Contas; Operações Bancárias; Funcionalidades Avançadas; Testes e Simulações.",

    "descricao-projeto3": "Este projeto é um Menu Interativo em Python que demonstra habilidades fundamentais em programação. O menu permite ao usuário selecionar opções específicas, utilizando estruturas como funções, loops (como while), e controles de fluxo (if, else, break, e continue). Além disso, o projeto faz uso de bibliotecas essenciais como math e random.",

    "saiba-mais": "Saiba mais",

    "api-titulo": "Repositórios GitHub",

    "api-descricao": "Acesse meus outros repositórios no GitHub para ver mais projetos e contribuições.",

    "ver-todos": "Ver todos",

    "contato": "Contato",
    "telefone": "Telefone",
    "whatsapp": "<span>Whatsapp:</span> Clique Aqui"
}   